NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
    /* Verify resulting state */
    TEST_ASSERT_EQUAL_UINT32_ARRAY(access_addresses,
                                   m_scanner.config.access_addresses,
                                   ARRAY_SIZE(access_addresses));

    /* Test invalid values */
    TEST_NRF_MESH_ASSERT_EXPECT(
        scanner_config_access_addresses_set(access_addresses, ARRAY_SIZE(access_addresses) + 1));
    TEST_NRF_MESH_ASSERT_EXPECT(scanner_config_access_addresses_set(access_addresses, 0));
}

void test_config_reset(void)
{
    uint8_t channels[] = SCANNER_CHANNELS_DEFAULT;
    uint32_t access_addresses[] =
    {
        BEARER_ACCESS_ADDR_DEFAULT,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID,
        SCANNER_ACCESS_ADDR_INVALID
    };

    /* When resetting when enabled in continuous mode, window start timer shall be scheduled */
    scanner_enable_helper();
    scanner_config_radio_mode_set(RADIO_MODE_NRF_2MBIT);
    timer_now_ExpectAndReturn(TIME_NOW);
    timer_sch_abort_Expect(&m_scanner.timer_window_end);
    timer_sch_reschedule_Expect(&m_scanner.timer_window_start, TIME_NOW);
    scanner_config_reset();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL_UINT8_ARRAY(channels,
                                  m_scanner.config.channels,
                                  ARRAY_SIZE(channels));
    TEST_ASSERT_EQUAL_UINT8(ARRAY_SIZE(channels),
                            m_scanner.config.channel_count);
    TEST_ASSERT_EQUAL_UINT8(0, m_scanner.channel_index);
    TEST_ASSERT_EQUAL_UINT32_ARRAY(access_addresses,
                                   m_scanner.config.access_addresses,
                                   ARRAY_SIZE(access_addresses));
    TEST_ASSERT_EQUAL(RADIO_MODE_BLE_1MBIT, m_scanner.config.radio_config.radio_mode);
    TEST_ASSERT_EQUAL_UINT8(RADIO_CONFIG_ADV_MAX_PAYLOAD_SIZE,
                            m_scanner.config.radio_config.payload_maxlen);
    TEST_ASSERT_EQUAL_UINT32(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS),
                             m_scanner.config.scan_interval_us);
    TEST_ASSERT_EQUAL_UINT32(MS_TO_US(BEARER_SCAN_WINDOW_DEFAULT_MS),
                             m_scanner.config.scan_window_us);
    TEST_ASSERT_EQUAL_UINT32(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS),
                             m_scanner.timer_window_end.interval);
    TEST_ASSERT_EQUAL_UINT32(MS_TO_US(BEARER_SCAN_INT_DEFAULT_MS),
                             m_scanner.timer_window_start.interval);
}

void test_radio_start_NOT_IN_WINDOW(void)
{
    scanner_enable_helper();
    m_radio.EVENTS_ADDRESS = 1;
    m_scanner.window_state = SCAN_WINDOW_STATE_OFF;
    radio_config_reset_Expect();
    radio_config_config_Expect(&m_scanner.config.radio_config);
    radio_config_access_addr_set_Expect(BEARER_ACCESS_ADDR_DEFAULT, 0);

    scanner_radio_start();

    /* Verify resulting state */
    TEST_ASSERT_NOT_EQUAL(0, m_radio.RXADDRESSES);
    TEST_ASSERT_EQUAL(RADIO_INTENSET_END_Msk, m_radio.INTENSET);
    TEST_ASSERT_EQUAL(RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk,
                      m_radio.SHORTS);
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_ADDRESS);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_RADIO->EVENTS_ADDRESS,
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].EEP);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_TIMER0->TASKS_CAPTURE[TIMER_INDEX_RADIO],
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].TEP);
    TEST_ASSERT_EQUAL(1 << (TIMER_PPI_CH_START + TIMER_INDEX_RADIO), m_ppi.CHENSET);
    TEST_ASSERT_EQUAL(0, m_radio.TASKS_RXEN);
    TEST_ASSERT_EQUAL(0, m_radio.PACKETPTR);
    TEST_ASSERT_EQUAL(false, m_scanner.waiting_for_memory);
    TEST_ASSERT_NULL(m_scanner.p_buffer_packet);
}

void test_radio_start_IN_WINDOW(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_enable_helper();
    m_radio.EVENTS_ADDRESS = 1;
    radio_config_reset_Expect();
    radio_config_config_Expect(&m_scanner.config.radio_config);
    radio_config_access_addr_set_Expect(BEARER_ACCESS_ADDR_DEFAULT, 0);
    radio_config_channel_set_Expect(m_scanner.config.channels[0]);
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t), NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);

    scanner_radio_start();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(true, m_scanner.has_radio_context);
    TEST_ASSERT_NOT_EQUAL(0, m_radio.RXADDRESSES);
    TEST_ASSERT_EQUAL(RADIO_INTENSET_END_Msk, m_radio.INTENSET);
    TEST_ASSERT_EQUAL(RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk,
                      m_radio.SHORTS);
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_ADDRESS);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_RADIO->EVENTS_ADDRESS,
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].EEP);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_TIMER0->TASKS_CAPTURE[TIMER_INDEX_RADIO],
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].TEP);
    TEST_ASSERT_EQUAL(1 << (TIMER_PPI_CH_START + TIMER_INDEX_RADIO), m_ppi.CHENSET);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_RXEN);
    TEST_ASSERT_NOT_EQUAL(0, m_radio.PACKETPTR);
    TEST_ASSERT_EQUAL(false, m_scanner.waiting_for_memory);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
}

void test_radio_start_IN_WINDOW_BUFFER_RESERVE_FAILED(void)
{
    scanner_enable_helper();
    m_radio.EVENTS_ADDRESS = 1;
    radio_config_reset_Expect();
    radio_config_config_Expect(&m_scanner.config.radio_config);
    radio_config_access_addr_set_Expect(BEARER_ACCESS_ADDR_DEFAULT, 0);
    radio_config_channel_set_Expect(m_scanner.config.channels[0]);
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t), NRF_ERROR_NO_MEM);

