NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
    scanner_radio_start();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(true, m_scanner.has_radio_context);
    TEST_ASSERT_NOT_EQUAL(0, m_radio.RXADDRESSES);
    TEST_ASSERT_EQUAL(RADIO_INTENSET_END_Msk, m_radio.INTENSET);
    TEST_ASSERT_EQUAL(RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_ADDRESS_RSSISTART_Msk,
                      m_radio.SHORTS);
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_ADDRESS);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_RADIO->EVENTS_ADDRESS,
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].EEP);
    TEST_ASSERT_EQUAL((uint32_t) &NRF_TIMER0->TASKS_CAPTURE[TIMER_INDEX_RADIO],
                      m_ppi.CH[TIMER_PPI_CH_START + TIMER_INDEX_RADIO].TEP);
    TEST_ASSERT_EQUAL(1 << (TIMER_PPI_CH_START + TIMER_INDEX_RADIO), m_ppi.CHENSET);
    TEST_ASSERT_EQUAL(0, m_radio.TASKS_RXEN);
    TEST_ASSERT_EQUAL(0, m_radio.PACKETPTR);
    TEST_ASSERT_EQUAL(true, m_scanner.waiting_for_memory);
}

void test_radio_stop(void)
{
    scanner_start_helper();

    NRF_RADIO->EVENTS_END = 1;      /* Set END event flag to test that it is cleared */
    packet_buffer_free_Expect(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);

    scanner_radio_stop();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(false, m_scanner.has_radio_context);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_END);
    TEST_ASSERT_NULL(m_scanner.p_buffer_packet);
}

void test_radio_irq_handler_END_EVENT_CRC_ERROR(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_start_helper();

    /* Set up radio */
    m_radio.EVENTS_END = 1;
    NRF_RADIO->STATE   = RADIO_STATE_STATE_RxIdle;

    /* Set up radio_handle_end_event() */
    packet_buffer_free_Expect(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);

    /* Set up radio_setup_next_operation() */
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t),
                                          NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_END);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(1, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
}

void test_radio_irq_handler_END_EVENT_LENGTH_ERROR(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;
    scanner_packet_t * p_scanner_packet = (scanner_packet_t *)p_packet_buffer_packet->packet;

    scanner_start_helper();

    /* Set up radio */
    m_radio.EVENTS_END = 1;
    NRF_RADIO->STATE   = RADIO_STATE_STATE_RxIdle;
    m_radio.CRCSTATUS  = RADIO_CRCSTATUS_CRCSTATUS_CRCOk;

    p_scanner_packet->packet.header.length = m_scanner.config.radio_config.payload_maxlen + 1;

    /* Set up radio_handle_end_event() */
    packet_buffer_free_Expect(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);

    /* Set up radio_setup_next_operation() */
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t),
                                          NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_END);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(1, scanner_stats_get()->length_out_of_bounds);
}

void test_radio_irq_handler_END_EVENT_SUCCESSFUL(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;
    scanner_packet_t * p_scanner_packet = (scanner_packet_t *)p_packet_buffer_packet->packet;

    scanner_window_started_helper();

    /* Set up radio */
    m_radio.EVENTS_END  = 1;
    m_radio.CRCSTATUS   = RADIO_CRCSTATUS_CRCSTATUS_CRCOk;
    m_radio.RSSISAMPLE  = RSSISAMPLE_VALUE;
    m_radio.RXMATCH     = RXMATCH_VALUE;
    m_radio.DATAWHITEIV = DATAWHITEIV_VALUE;
    m_radio.STATE       = RADIO_STATE_STATE_RxIdle;

    p_scanner_packet->packet.header.length = 2;

    m_timer0.CC[SCANNER_TIMER_INDEX] = TIME_UNTIL_END_EVENT;

    /* Set up radio_handle_end_event() */
    timeslot_start_time_get_ExpectAndReturn(TIME_NOW);
    packet_buffer_commit_Expect(&m_scanner.packet_buffer,
                                m_scanner.p_buffer_packet,
                                SCANNER_PACKET_OVERHEAD +
                                    ((scanner_packet_t *)m_scanner.p_buffer_packet->packet)->
                                        packet.header.length);
    packet_buffer_commit_IgnoreArg_length();
    bearer_event_flag_set_Expect(BEARER_EVENT_FLAG);

    /* Set up radio_setup_next_operation() */
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet, sizeof(scanner_packet_t),
                                          NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_END);
    TEST_ASSERT_EQUAL_UINT32(TIME_NOW + TIME_UNTIL_END_EVENT, p_scanner_packet->metadata.timestamp);
    TEST_ASSERT_EQUAL_UINT32(m_scanner.config.access_addresses[NRF_RADIO->RXMATCH], p_scanner_packet->metadata.access_addr);
    TEST_ASSERT_EQUAL_UINT8(DATAWHITEIV_VALUE & 0x3F, p_scanner_packet->metadata.channel);
    TEST_ASSERT_EQUAL_INT8(-RSSISAMPLE_VALUE, p_scanner_packet->metadata.rssi);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL_UINT32(1, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
}

