NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_scanner.c
static void packet_buffer_free_callback_AFTER_WINDOW_START(packet_buffer_t* const p_buffer, packet_buffer_packet_t* const p_packet, int cmock_num_calls)
{
    packet_buffer_free_callback_cnt++;

    TEST_ASSERT_EQUAL_PTR(&m_scanner.packet_buffer, p_buffer);
    TEST_ASSERT_EQUAL_PTR(m_scanner.p_buffer_packet, p_packet);
    TEST_ASSERT_EQUAL(0, cmock_num_calls);

    /* Simulate radio behavior when disabling the radio */
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    m_radio.STATE = RADIO_STATE_STATE_Disabled;
}

void test_radio_irq_handler_AFTER_WINDOW_START(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;

    scanner_window_start_helper();

    packet_buffer_free_StubWithCallback(packet_buffer_free_callback_AFTER_WINDOW_START);
    radio_config_channel_set_Expect(m_scanner.config.channels[1]);
    packet_buffer_reserve_ExpectAndReturn(&m_scanner.packet_buffer,
                                          &m_scanner.p_buffer_packet,
                                          sizeof(scanner_packet_t), NRF_SUCCESS);
    packet_buffer_reserve_ReturnThruPtr_pp_packet(&p_packet_buffer_packet);
    m_radio.TASKS_RXEN = 0;

    scanner_radio_irq_handler();

    packet_buffer_free_StubWithCallback(NULL);

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, packet_buffer_free_callback_cnt);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    TEST_ASSERT_NOT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_RXEN);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
}

void test_radio_irq_handler_AFTER_WINDOW_END(void)
{
    scanner_window_end_helper();

    packet_buffer_free_Expect(&m_scanner.packet_buffer, m_scanner.p_buffer_packet);
    m_radio.TASKS_RXEN = 0;

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    TEST_ASSERT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_OFF, m_scanner.window_state);
    TEST_ASSERT_EQUAL(0, m_radio.TASKS_RXEN);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
}

void test_radio_irq_handler_SCANNER_DISABLE(void)
{
    scanner_disable_helper();

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    TEST_ASSERT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_ON, m_scanner.window_state);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
}

void test_radio_irq_handler_RADIO_INTERRUPT_INSIDE_WINDOW(void)
{
    scanner_window_started_helper();
    scanner_radio_irq_handler();
}

void test_radio_irq_handler_WINDOW_END_AFTER_RX(void)
{
    packet_buffer_packet_t * p_packet_buffer_packet =
        (packet_buffer_packet_t *)m_scanner.packet_buffer_data;
    scanner_packet_t * p_scanner_packet = (scanner_packet_t *)p_packet_buffer_packet->packet;

    scanner_window_started_helper();

    /* End scan window */
    NVIC_SetPendingIRQ_Expect(RADIO_IRQn);
    m_scanner.timer_window_end.cb(TIME_NOW, NULL);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_OFF, m_scanner.window_state);

    /* Set up radio */
    m_radio.EVENTS_END  = 1;
    m_radio.CRCSTATUS   = RADIO_CRCSTATUS_CRCSTATUS_CRCOk;
    m_radio.RSSISAMPLE  = RSSISAMPLE_VALUE;
    m_radio.RXMATCH     = RXMATCH_VALUE;
    m_radio.DATAWHITEIV = DATAWHITEIV_VALUE;
    m_radio.STATE       = RADIO_STATE_STATE_RxIdle;

    p_scanner_packet->packet.header.length = 2;

    m_timer0.CC[SCANNER_TIMER_INDEX] = TIME_UNTIL_END_EVENT;

    /* Set up radio_handle_end_event() */
    timeslot_start_time_get_ExpectAndReturn(TIME_NOW);
    packet_buffer_commit_Expect(&m_scanner.packet_buffer,
                                m_scanner.p_buffer_packet,
                                SCANNER_PACKET_OVERHEAD +
                                    ((scanner_packet_t *)m_scanner.p_buffer_packet->packet)->
                                        packet.header.length);
    packet_buffer_commit_IgnoreArg_length();
    bearer_event_flag_set_Expect(BEARER_EVENT_FLAG);

    scanner_radio_irq_handler();

    /* Verify resulting state */
    TEST_ASSERT_EQUAL(0, m_radio.EVENTS_END);
    TEST_ASSERT_EQUAL_UINT32(TIME_NOW + TIME_UNTIL_END_EVENT, p_scanner_packet->metadata.timestamp);
    TEST_ASSERT_EQUAL_UINT32(m_scanner.config.access_addresses[NRF_RADIO->RXMATCH], p_scanner_packet->metadata.access_addr);
    TEST_ASSERT_EQUAL_UINT8(DATAWHITEIV_VALUE & 0x3F, p_scanner_packet->metadata.channel);
    TEST_ASSERT_EQUAL_INT8(-RSSISAMPLE_VALUE, p_scanner_packet->metadata.rssi);
    TEST_ASSERT_NULL(m_scanner.p_buffer_packet);
    TEST_ASSERT_EQUAL(SCAN_WINDOW_STATE_OFF, m_scanner.window_state);
    TEST_ASSERT_EQUAL_UINT32(1, scanner_stats_get()->successful_receives);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->crc_failures);
    TEST_ASSERT_EQUAL_UINT32(0, scanner_stats_get()->length_out_of_bounds);
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
}

static void packet_buffer_free_callback_WINDOW_START_DURING_RADIO_RX(packet_buffer_t* const p_buffer, packet_buffer_packet_t* const p_packet, int cmock_num_calls)
{
    packet_buffer_free_callback_cnt++;

    TEST_ASSERT_EQUAL_PTR(&m_scanner.packet_buffer, p_buffer);
    TEST_ASSERT_EQUAL_PTR(m_scanner.p_buffer_packet, p_packet);
    TEST_ASSERT_EQUAL(1, cmock_num_calls);      /*packet_buffer_free has already been called once from scanner_window_started_helper */

    /* Simulate radio behavior when disabling the radio */
    TEST_ASSERT_EQUAL(1, m_radio.TASKS_DISABLE);
    m_radio.STATE = RADIO_STATE_STATE_Disabled;
}

